HELYXcore-4.4.0/examples/legacy/multiphase/compressibleInterFoam/laminar/depthCharge3D/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    multiphase;
energy          sensibleInternalEnergy;
mixture         volumeMixture;
passivePhase air;

phases (water air);

pMin        10000;

sigma       0.07;
air
{
    materialType    fluid;
    muModel         scalarFunction1;
    kappaModel      kappaPrandtl;
    thermodynamics  hConst;
    equationOfState perfectGas;
    energy          sensibleInternalEnergy;
    molWeight   28.9;

    thermodynamicsCoeffs
    {
        Cp          1007;
        Hf          0;
    }
    muModelCoeffs
    {
        mu          1.84e-05;
    }
    kappaModelCoeffs
    {
        Pr          0.7;
    }
}


water
{
    materialType    fluid;
    muModel         scalarFunction1;
    kappaModel      kappaPrandtl;
    thermodynamics  eConst;
    equationOfState rhoConst;

    molWeight   18.0;

    equationOfStateCoeffs
    {
        rho         1000;
    }
    thermodynamicsCoeffs
    {
        Cv          4195;
        Hf          0;
    }
    muModelCoeffs
    {
        mu          3.645e-4;
    }
    kappaModelCoeffs
    {
        Pr          2.289;
    }
}


// ************************************************************************* //
