HELYXcore-4.4.0/examples/legacy/multiphase/compressibleInterFoam/laminar/depthCharge3D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 1e5
    volScalarFieldValue p 1e5
    volScalarFieldValue T 300
);

regions
(
    sphereToCell
    {
        centre (0.5 0.5 0.5);
        radius 0.1;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 1e6
            volScalarFieldValue p 1e6
            volScalarFieldValue T 578
        );
    }
    boxToCell
    {
        box (-10 1 -1) (10 10 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
